collected-data/gfs-4-rep-results/experiements-1-3/3-failure/tfd/fio-gfs-test-low-seq-read-tfd.txt
Started: 15-04-2022--00-21-48

low-seq-read-/mnt/gfs: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
low-seq-read-/mnt/gfs: Laying out IO file (1 file / 100MiB)

low-seq-read-/mnt/gfs: (groupid=0, jobs=1): err= 0: pid=7575: Fri Apr 15 00:22:29 2022
  read: IOPS=78, BW=9.78MiB/s (10.3MB/s)(61.0MiB/6236msec)
    slat (nsec): min=10057, max=21581, avg=11086.03, stdev=858.79
    clat (usec): min=12166, max=15637, avg=12756.65, stdev=290.07
     lat (usec): min=12179, max=15650, avg=12769.40, stdev=290.10
    clat percentiles (usec):
     |  1.00th=[12256],  5.00th=[12256], 10.00th=[12649], 20.00th=[12649],
     | 30.00th=[12649], 40.00th=[12780], 50.00th=[12780], 60.00th=[12780],
     | 70.00th=[12780], 80.00th=[12911], 90.00th=[12911], 95.00th=[13042],
     | 99.00th=[14222], 99.50th=[14353], 99.90th=[15664], 99.95th=[15664],
     | 99.99th=[15664]
   bw (  KiB/s): min= 9747, max=10240, per=99.89%, avg=10006.92, stdev=128.25, samples=12
   iops        : min=   76, max=   80, avg=78.17, stdev= 1.03, samples=12
  lat (msec)   : 20=100.00%
  cpu          : usr=0.00%, sys=0.21%, ctx=489, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=488,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=9.78MiB/s (10.3MB/s), 9.78MiB/s-9.78MiB/s (10.3MB/s-10.3MB/s), io=61.0MiB (64.0MB), run=6236-6236msec
low-seq-read-/mnt/gfs: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
low-seq-read-/mnt/gfs: Laying out IO file (1 file / 100MiB)

low-seq-read-/mnt/gfs: (groupid=0, jobs=1): err= 0: pid=9070: Fri Apr 15 00:26:23 2022
  read: IOPS=77, BW=9972KiB/s (10.2MB/s)(61.0MiB/6264msec)
    slat (nsec): min=9149, max=23746, avg=10870.81, stdev=1262.55
    clat (usec): min=12181, max=15542, avg=12811.86, stdev=291.59
     lat (usec): min=12193, max=15554, avg=12824.35, stdev=291.54
    clat percentiles (usec):
     |  1.00th=[12256],  5.00th=[12256], 10.00th=[12649], 20.00th=[12780],
     | 30.00th=[12780], 40.00th=[12780], 50.00th=[12780], 60.00th=[12780],
     | 70.00th=[12911], 80.00th=[12911], 90.00th=[12911], 95.00th=[13042],
     | 99.00th=[14353], 99.50th=[14484], 99.90th=[15533], 99.95th=[15533],
     | 99.99th=[15533]
   bw (  KiB/s): min= 9747, max= 9984, per=99.92%, avg=9964.25, stdev=68.42, samples=12
   iops        : min=   76, max=   78, avg=77.83, stdev= 0.58, samples=12
  lat (msec)   : 20=100.00%
  cpu          : usr=0.02%, sys=0.18%, ctx=490, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=488,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=9972KiB/s (10.2MB/s), 9972KiB/s-9972KiB/s (10.2MB/s-10.2MB/s), io=61.0MiB (64.0MB), run=6264-6264msec
low-seq-read-/mnt/gfs: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
low-seq-read-/mnt/gfs: Laying out IO file (1 file / 100MiB)

low-seq-read-/mnt/gfs: (groupid=0, jobs=1): err= 0: pid=10562: Fri Apr 15 00:30:18 2022
  read: IOPS=78, BW=9995KiB/s (10.2MB/s)(60.9MiB/6237msec)
    slat (nsec): min=9359, max=30521, avg=10870.89, stdev=1331.90
    clat (usec): min=12178, max=16053, avg=12784.01, stdev=297.93
     lat (usec): min=12190, max=16066, avg=12796.54, stdev=298.01
    clat percentiles (usec):
     |  1.00th=[12256],  5.00th=[12256], 10.00th=[12649], 20.00th=[12649],
     | 30.00th=[12780], 40.00th=[12780], 50.00th=[12780], 60.00th=[12780],
     | 70.00th=[12780], 80.00th=[12911], 90.00th=[12911], 95.00th=[13042],
     | 99.00th=[14353], 99.50th=[14484], 99.90th=[16057], 99.95th=[16057],
     | 99.99th=[16057]
   bw (  KiB/s): min= 9984, max=10004, per=99.90%, avg=9985.67, stdev= 5.77, samples=12
   iops        : min=   78, max=   78, avg=78.00, stdev= 0.00, samples=12
  lat (msec)   : 20=100.00%
  cpu          : usr=0.00%, sys=0.21%, ctx=490, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=487,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=9995KiB/s (10.2MB/s), 9995KiB/s-9995KiB/s (10.2MB/s-10.2MB/s), io=60.9MiB (63.8MB), run=6237-6237msec