collected-data/gfs-4-rep-results/experiements-1-3/3-failure/tfd/fio-gfs-test-low-seq-rw-tfd.txt
Started: 15-04-2022--00-33-32

low-seq-rw-/mnt/gfs: (g=0): rw=rw, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
low-seq-rw-/mnt/gfs: Laying out IO file (1 file / 100MiB)

low-seq-rw-/mnt/gfs: (groupid=0, jobs=1): err= 0: pid=12064: Fri Apr 15 00:34:23 2022
  read: IOPS=19, BW=2519KiB/s (2580kB/s)(37.9MiB/15396msec)
    slat (nsec): min=9638, max=30312, avg=11536.26, stdev=1643.39
    clat (usec): min=12156, max=17336, avg=12483.26, stdev=527.17
     lat (usec): min=12169, max=17348, avg=12496.49, stdev=527.26
    clat percentiles (usec):
     |  1.00th=[12125],  5.00th=[12256], 10.00th=[12256], 20.00th=[12256],
     | 30.00th=[12256], 40.00th=[12387], 50.00th=[12387], 60.00th=[12387],
     | 70.00th=[12518], 80.00th=[12518], 90.00th=[12780], 95.00th=[13042],
     | 99.00th=[13304], 99.50th=[17171], 99.90th=[17433], 99.95th=[17433],
     | 99.99th=[17433]
   bw (  KiB/s): min= 1024, max= 4608, per=98.21%, avg=2474.93, stdev=872.16, samples=30
   iops        : min=    8, max=   36, avg=19.33, stdev= 6.81, samples=30
  write: IOPS=21, BW=2744KiB/s (2809kB/s)(41.2MiB/15396msec); 0 zone resets
    slat (nsec): min=32267, max=50566, avg=37791.22, stdev=2598.84
    clat (usec): min=34878, max=35747, avg=35120.99, stdev=122.24
     lat (usec): min=34916, max=35786, avg=35160.52, stdev=122.09
    clat percentiles (usec):
     |  1.00th=[34866],  5.00th=[34866], 10.00th=[34866], 20.00th=[34866],
     | 30.00th=[34866], 40.00th=[34866], 50.00th=[34866], 60.00th=[35390],
     | 70.00th=[35390], 80.00th=[35390], 90.00th=[35390], 95.00th=[35390],
     | 99.00th=[35390], 99.50th=[35914], 99.90th=[35914], 99.95th=[35914],
     | 99.99th=[35914]
   bw (  KiB/s): min= 2048, max= 3328, per=100.00%, avg=2756.60, stdev=334.07, samples=30
   iops        : min=   16, max=   26, avg=21.53, stdev= 2.61, samples=30
  lat (msec)   : 20=47.87%, 50=52.13%
  cpu          : usr=0.06%, sys=0.08%, ctx=966, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=303,330,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=2519KiB/s (2580kB/s), 2519KiB/s-2519KiB/s (2580kB/s-2580kB/s), io=37.9MiB (39.7MB), run=15396-15396msec
  WRITE: bw=2744KiB/s (2809kB/s), 2744KiB/s-2744KiB/s (2809kB/s-2809kB/s), io=41.2MiB (43.3MB), run=15396-15396msec
low-seq-rw-/mnt/gfs: (g=0): rw=rw, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
low-seq-rw-/mnt/gfs: Laying out IO file (1 file / 100MiB)

low-seq-rw-/mnt/gfs: (groupid=0, jobs=1): err= 0: pid=13571: Fri Apr 15 00:38:20 2022
  read: IOPS=19, BW=2518KiB/s (2578kB/s)(37.9MiB/15403msec)
    slat (nsec): min=9219, max=22070, avg=11354.42, stdev=1361.98
    clat (usec): min=12168, max=17342, avg=12487.37, stdev=422.56
     lat (usec): min=12179, max=17355, avg=12500.41, stdev=422.68
    clat percentiles (usec):
     |  1.00th=[12125],  5.00th=[12256], 10.00th=[12256], 20.00th=[12256],
     | 30.00th=[12387], 40.00th=[12387], 50.00th=[12387], 60.00th=[12518],
     | 70.00th=[12518], 80.00th=[12518], 90.00th=[12780], 95.00th=[13042],
     | 99.00th=[13173], 99.50th=[16188], 99.90th=[17433], 99.95th=[17433],
     | 99.99th=[17433]
   bw (  KiB/s): min=  768, max= 4608, per=98.25%, avg=2474.97, stdev=897.74, samples=30
   iops        : min=    6, max=   36, avg=19.33, stdev= 7.01, samples=30
  write: IOPS=21, BW=2742KiB/s (2808kB/s)(41.2MiB/15403msec); 0 zone resets
    slat (nsec): min=30031, max=56502, avg=37790.82, stdev=2965.47
    clat (usec): min=34861, max=39476, avg=35136.40, stdev=269.05
     lat (usec): min=34902, max=39516, avg=35175.97, stdev=269.07
    clat percentiles (usec):
     |  1.00th=[34866],  5.00th=[34866], 10.00th=[34866], 20.00th=[34866],
     | 30.00th=[34866], 40.00th=[34866], 50.00th=[34866], 60.00th=[35390],
     | 70.00th=[35390], 80.00th=[35390], 90.00th=[35390], 95.00th=[35390],
     | 99.00th=[35390], 99.50th=[35914], 99.90th=[39584], 99.95th=[39584],
     | 99.99th=[39584]
   bw (  KiB/s): min= 2048, max= 3328, per=100.00%, avg=2756.60, stdev=333.94, samples=30
   iops        : min=   16, max=   26, avg=21.53, stdev= 2.61, samples=30
  lat (msec)   : 20=47.87%, 50=52.13%
  cpu          : usr=0.01%, sys=0.13%, ctx=965, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=303,330,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=2518KiB/s (2578kB/s), 2518KiB/s-2518KiB/s (2578kB/s-2578kB/s), io=37.9MiB (39.7MB), run=15403-15403msec
  WRITE: bw=2742KiB/s (2808kB/s), 2742KiB/s-2742KiB/s (2808kB/s-2808kB/s), io=41.2MiB (43.3MB), run=15403-15403msec
low-seq-rw-/mnt/gfs: (g=0): rw=rw, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
low-seq-rw-/mnt/gfs: Laying out IO file (1 file / 100MiB)

low-seq-rw-/mnt/gfs: (groupid=0, jobs=1): err= 0: pid=15169: Fri Apr 15 00:42:33 2022
  read: IOPS=19, BW=2511KiB/s (2571kB/s)(37.9MiB/15447msec)
    slat (nsec): min=9289, max=22489, avg=11450.54, stdev=1559.09
    clat (usec): min=12151, max=20037, avg=12526.00, stdev=560.03
     lat (usec): min=12163, max=20051, avg=12539.15, stdev=560.35
    clat percentiles (usec):
     |  1.00th=[12125],  5.00th=[12256], 10.00th=[12256], 20.00th=[12256],
     | 30.00th=[12256], 40.00th=[12387], 50.00th=[12518], 60.00th=[12518],
     | 70.00th=[12518], 80.00th=[12649], 90.00th=[12780], 95.00th=[13042],
     | 99.00th=[13566], 99.50th=[15795], 99.90th=[20055], 99.95th=[20055],
     | 99.99th=[20055]
   bw (  KiB/s): min= 1024, max= 4608, per=98.22%, avg=2466.40, stdev=838.16, samples=30
   iops        : min=    8, max=   36, avg=19.27, stdev= 6.55, samples=30
  write: IOPS=21, BW=2735KiB/s (2800kB/s)(41.2MiB/15447msec); 0 zone resets
    slat (nsec): min=30032, max=53009, avg=37817.86, stdev=2969.61
    clat (usec): min=34765, max=64000, avg=35235.79, stdev=1600.02
     lat (usec): min=34811, max=64039, avg=35275.39, stdev=1600.01
    clat percentiles (usec):
     |  1.00th=[34866],  5.00th=[34866], 10.00th=[34866], 20.00th=[34866],
     | 30.00th=[34866], 40.00th=[34866], 50.00th=[35390], 60.00th=[35390],
     | 70.00th=[35390], 80.00th=[35390], 90.00th=[35390], 95.00th=[35390],
     | 99.00th=[35390], 99.50th=[38011], 99.90th=[64226], 99.95th=[64226],
     | 99.99th=[64226]
   bw (  KiB/s): min= 2048, max= 3328, per=100.00%, avg=2748.10, stdev=322.20, samples=30
   iops        : min=   16, max=   26, avg=21.47, stdev= 2.52, samples=30
  lat (msec)   : 20=47.71%, 50=52.13%, 100=0.16%
  cpu          : usr=0.04%, sys=0.10%, ctx=965, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=303,330,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=2511KiB/s (2571kB/s), 2511KiB/s-2511KiB/s (2571kB/s-2571kB/s), io=37.9MiB (39.7MB), run=15447-15447msec
  WRITE: bw=2735KiB/s (2800kB/s), 2735KiB/s-2735KiB/s (2800kB/s-2800kB/s), io=41.2MiB (43.3MB), run=15447-15447msec